src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="877a04b6-4c0b-4715-b826-6ac77909e040">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/табАид_КонтактныеЛицаПартнеров/табАид_КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>табАид_КонтактныеЛицаПартнеров</name>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КонтактныеЛицаПартнеров/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура табАид_КонтактноеЛицоТАБАИДВместо(Команда)
	ТекДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекДанные = неопределено Тогда
		Возврат;
	КонецЕсли;
	табАид_КонтактноеЛицоТАБАИДНаСервере(ТекДанные);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура табАид_КонтактноеЛицоТАБАИДНаСервере(КонтактноеЛицо)
	ЗаписьКонтЛицоТАБАИД = РегистрыСведений.табАид_КонтактныеЛицаПартнеров.СоздатьМенеджерЗаписи();
	ЗаписьКонтЛицоТАБАИД.Партнер = КонтактноеЛицо.Владелец;
	ЗаписьКонтЛицоТАБАИД.КонтактноеЛицо = КонтактноеЛицо;
	ЗаписьКонтЛицоТАБАИД.Записать(Истина);
	табАид_УстановитьУсловноеОформление(КонтактноеЛицо.Владелец);
КонецПроцедуры

Процедура табАид_УстановитьУсловноеОформление(Партнер) Экспорт
	Список.УсловноеОформление.Элементы.Очистить();
	ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПартнерыИКонтрагенты.табАид_ПолучитьКонтактноеЛицоПартнера(Партнер);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина,,,,));
КонецПроцедуры

&НаСервере
Процедура табАид_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	табАид_УстановитьУсловноеОформление(Параметры.Отбор.Владелец);
КонецПроцедуры
